In [1]:
import numpy as np, pandas as pd

In [2]:
s = pd.Series([1, 2, 3, 4])
print(s)

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
s1 = pd.Series([1, 2, 3, 4])
s2 = pd.Series([1, 4, 9, 16])
df = pd.DataFrame({'Number' : s1, "Square" : s2})
print(df)

   Number  Square
0       1       1
1       2       4
2       3       9
3       4      16

### Reading Data

In [4]:
file_path = 'titanic_train.csv'
df = pd.read_csv(file_path)

### Checking top/bottom rows

In [5]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

By default the head function prints top 5 rows, we can give argument to head function to let specify how much rows should be printed.

In [6]:
#printing only 2 rows
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

Similarly we can also use tail function to see the bottom rows of data frame.

In [7]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### Size of DataFrame

In [8]:
df.shape

(891, 12)

### Basic information of DataFrame

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [10]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

### Basic statitistics of DataFrame

We can check basic statistics like mean, median, standard deviation, min, max and quartiles of number column in the dataframe.

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
df['Age'].describe()

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

We can also find individual values by using their respective functions.

In [13]:
print("Count (Non-Null) :", df['Age'].count())
print("Mean :", df['Age'].mean())
print("Median :", df['Age'].median())
print("STD :", df['Age'].std())
print(f"Min : {df['Age'].min()}, Max :{df['Age'].max()}")

Count (Non-Null) : 714
Mean : 29.69911764705882
Median : 28.0
STD : 14.526497332334044
Min : 0.42, Max :80.0

### Accessing Columns and Rows of DataFrame

#### Accessing with column name

In [14]:
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [15]:
df.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

Ok, accessing columns is fine. But what if you want access 2nd element in the column. Let's see how we can do that.

In [16]:
df['Age'][1]

38.0

We can also get multiple columns by passing list of columns.

In [17]:
df[['Name', 'Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [18]:
df.loc[:, 'Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

#### Accessing based on position index

In [19]:
#1st row of 5th column i.e., Age column 
df.iloc[0, 5]

22.0

In [20]:
#all the rows in 5th column.
df.iloc[:, 5]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [21]:
df.iloc[0:5, :]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

iloc and loc can select rows/columns with the help of boolean values. Let me demonstrate that to you with smallar dataframe. lets extract only top 5 rows and 1st 5 columns of data frame and create a new data frame with that.

In [22]:
sample = df.iloc[0:5, 0:5]

In [23]:
sample.head()

,PassengerId,Survived,Pclass,Name,Sex
0,1,0,3,"Braund, Mr. Owen Harris",male
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female
2,3,1,3,"Heikkinen, Miss. Laina",female
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female
4,5,0,3,"Allen, Mr. William Henry",male

Let's select alternate rows using boolean values.

In [24]:
sample.iloc[[True, False, True, False, True], :]

   PassengerId  Survived  Pclass                      Name     Sex
0            1         0       3   Braund, Mr. Owen Harris    male
2            3         1       3    Heikkinen, Miss. Laina  female
4            5         0       3  Allen, Mr. William Henry    male

As you can see, we have passed the list of True/False to rows_indexes. The list of True/False should match the length of rows then only the selection will work. The row index which we want to select should be True and other should be False.  
As we want to select alternate rows, we have passed True/False alternately and the output is 0, 2 and 4 rows of data frame.

### Slicing Data (Conditional Selction)

In [25]:
age_60 = df[df.Age >= 60]
age_60.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,26.000000,26.000000,26.000000,26.000000,26.000000,26.000000,26.000000
mean,455.807692,0.269231,1.538462,65.096154,0.230769,0.307692,43.467950
std,240.078490,0.452344,0.811456,5.110811,0.429669,0.837579,51.269998
min,34.000000,0.000000,1.000000,60.000000,0.000000,0.000000,6.237500
25%,277.250000,0.000000,1.000000,61.250000,0.000000,0.000000,10.500000
50%,489.000000,0.000000,1.000000,63.500000,0.000000,0.000000,28.275000
75%,629.750000,0.750000,2.000000,69.000000,0.000000,0.000000,58.860450
max,852.000000,1.000000,3.000000,80.000000,1.000000,4.000000,263.000000

In [26]:
df.Age >= 60

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Age, Length: 891, dtype: bool

Its a Boolean series, as we have seen earlier we can select rows based on the True or False of respective row.  
We can even quickly see number of rows with true by using sum function on the series.

In [27]:
(df.Age >= 60).sum()

26

The number of people who has age more than or equal to 60 years are 26.

We can also select columns, in a similar approach but using loc.

In [28]:
text_cols = ['Name', 'Sex', 'Ticket', 'Embarked']
df.loc[:, df.columns.isin(text_cols)].head()

,Name,Sex,Ticket,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,S
4,"Allen, Mr. William Henry",male,373450,S

### Unique values detection

In [29]:
#count of unique values in each column
df.nunique()

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

In [30]:
#list of unique values in Sex column
print(df['Sex'].unique())

['male' 'female']

### Data Modification (apply and map)

In [31]:
df['Sex_map'] = df.Sex.map({'male':1, 'female':0})
df[['Sex', 'Sex_map']].head()

      Sex  Sex_map
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

For apply function we use a lambda/function to do the the mapping

In [32]:
df['Sex_apply'] = df.Sex.apply(lambda x: 1 if x == 'male' else 0)
df[['Sex', 'Sex_apply']].head()

      Sex  Sex_apply
0    male          1
1  female          0
2  female          0
3  female          0
4    male          1

In [33]:
df['Name'] = df.Name.str.lower()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_map,Sex_apply
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,1
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,0
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,0
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S,0,0
4,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S,1,1

We can also apply regex and other string operation on each value in place of lower fuction.

### Missing (null/na) value detection

In [34]:
df.isnull()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Sex_map,Sex_apply
0,False,False,False,False,False,False,False,False,False,False,True,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,True,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,False,False,False,False,False,False,False,False,False,False,True,False,False,False
887,False,False,False,False,False,False,False,False,False,False,False,False,False,False
888,False,False,False,False,False,True,False,False,False,False,True,False,False,False
889,False,False,False,False,False,False,False,False,False,False,False,False,False,False
890,False,False,False,False,False,False,False,False,False,False,True,False,False,False

In [35]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Sex_map          0
Sex_apply        0
dtype: int64

In [36]:
round(100*df.isnull().sum()/len(df.index), 2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.87
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.10
Embarked        0.22
Sex_map         0.00
Sex_apply       0.00
dtype: float64

You can see Age, Cabin and Embarked has column has 19%, 77% and 0.22%  of missing values respectively.

### Droping Rows

In [37]:
df = df[~df.Embarked.isnull()]
round(100*df.isnull().sum()/len(df.index), 2)

PassengerId     0.00
Survived        0.00
Pclass          0.00
Name            0.00
Sex             0.00
Age            19.91
SibSp           0.00
Parch           0.00
Ticket          0.00
Fare            0.00
Cabin          77.28
Embarked        0.00
Sex_map         0.00
Sex_apply       0.00
dtype: float64

### Dropping and renaming columns

In [38]:
df = df.drop(['Cabin'], axis=1)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Embarked', 'Sex_map', 'Sex_apply'],
      dtype='object')

While doing data manupulation we have create two columns Sex_map and Sex_apply. We need only any of them and as we have transformed the variable we no longed need Sex column.

In [39]:
df = df.drop(['Sex', 'Sex_map'], axis=1)

Its not intuative to have the column name as Sex_apply, we can rename to Sex as follows

In [40]:
df = df.rename({'Sex_apply':'Sex'}, axis=1)
df.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Embarked,Sex
0,1,0,3,"braund, mr. owen harris",22.0,1,0,A/5 21171,7.2500,S,1
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",38.0,1,0,PC 17599,71.2833,C,0
2,3,1,3,"heikkinen, miss. laina",26.0,0,0,STON/O2. 3101282,7.9250,S,0
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",35.0,1,0,113803,53.1000,S,0
4,5,0,3,"allen, mr. william henry",35.0,0,0,373450,8.0500,S,1

### Imputing missing Values

In [41]:
df['Age'] = df['Age'].fillna(df.Age.mean())
round(100*df.isnull().sum()/len(df.index), 2)

PassengerId    0.0
Survived       0.0
Pclass         0.0
Name           0.0
Age            0.0
SibSp          0.0
Parch          0.0
Ticket         0.0
Fare           0.0
Embarked       0.0
Sex            0.0
dtype: float64

Now the Data set is cleaned and ready to do the Data Visualisation and other Analysis.